aesoAppTest/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "publisher", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Lord of the Ring"], ["publisher", "Amazon"], ["author_id", 1], ["created_at", "2021-09-20 20:06:51.368315"], ["updated_at", "2021-09-20 20:06:51.368315"]]